#+title: Emacs Config
#+author:
#+STARTUP: content

* Theme + Modeline + Neat stuff
  First, all the icons. This is necessary for doom-modeline. After initalization, you MUST RUN M-x all-the-icons-install-fonts. I wish i knew a workaround at the moment. Also sets up org-bullets, and rainbow delimiters. doom-old-hope is nice, for my light theme i like to use doom-gruvbox-light.

#+begin_src emacs-lisp
(use-package all-the-icons
  :if (display-graphic-p))

(use-package humanoid-themes)

(set-face-attribute 'default nil :family "CaskaydiaCove Nerd Font Mono" :height 70)

(use-package doom-themes
  :config
  (load-theme 'doom-old-hope t))


(use-package rainbow-delimiters
  :config
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))

;custom runs: after package loaded, init runs before 
(use-package doom-modeline
  :after all-the-icons
  :hook
  (after-init . doom-modeline-mode))
#+end_src

#+RESULTS:
| #[0 \300 \207 [dashboard-insert-startupify-lists] 1] | doom-modeline-mode | x-wm-set-size-hint | tramp-register-archive-file-name-handler | magit-maybe-define-global-key-bindings | table--make-cell-map |

* Matlab

EEEEEEEEE
#+begin_src emacs-lisp
;; 1. MATLAB
;; (load-library "matlab-load")            ; in MELPA
(add-to-list 'load-path "/home/ched/.emacs.d/matlab-mode/matlab-emacs-src~")
(require 'matlab-load)
(autoload 'matlab-mode "matlab" "Matlab Editing Mode" t)
(setq exec-path (append exec-path '("/home/ched/mathworks/r2021b/bin")))
;; customization
(setq matlab-indent-level 4)
(setq matlab-highlight-block-match-flag t)
(setq matlab-shell-command-switches '("-nodesktop -nosplash"))

; enable CEDET---not sure what it's useful for
(matlab-cedet-setup)

; matlab-mode has support for Completion engine. Using tools in CEDET, Emacs
; will parse your M files and provide pretty good completion and code
; decoration.

; enable MLINT
(setq mlint-programs (quote ("/home/ched/mathworks/r2021b/bin/glnxa64/mlint")))
(add-hook 'matlab-mode-hook (lambda () (mlint-minor-mode 1)))
(setq matlab-show-mlint-warnings t)
(setq matlab-highlight-cross-function-variables t)
;; For R, need install.packages("lintr")


; Customize comment string to '%' only rather than '% $$$'
(setq matlab-comment-region-s "% ")
#+end_src

#+RESULTS:
: % 

** Making Org Pretty 
From [[https://github.com/minad/org-modern][github]], org-modern

#+begin_src emacs-lisp results: nil
(use-package org-modern)
(add-hook 'org-mode-hook #'org-modern-mode)
(add-hook 'org-agenda-finalize-hook #'org-modern-agenda)
(setq
 ;; Edit settings
 org-auto-align-tags nil
 org-tags-column 0
 org-catch-invisible-edits 'show-and-error
 org-special-ctrl-a/e t
 org-insert-heading-respect-content t
 org-modern-block nil

 ;; Org styling, hide markup etc.
 org-hide-emphasis-markers t
 org-pretty-entities t
 org-ellipsis "…"

 ;; Agenda styling
 org-agenda-block-separator ?─
 org-agenda-time-grid
 '((daily today require-timed)
   (800 1000 1200 1400 1600 1800 2000)
   " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
 org-agenda-current-time-string
 "⭠ now ─────────────────────────────────────────────────")
#+end_src 

Now, for SVG tag mode
#+begin_src emacs-lisp
(use-package svg-tag-mode)

(setq svg-tag-tags
      '((":TODO:" . ((lambda (tag) (svg-tag-make "TODO"))))))

(setq svg-tag-tags
      '(("\\(:#[A-Za-z0-9]+\\)" . ((lambda (tag)
                                     (svg-tag-make tag :beg 2))))
        ("\\(:#[A-Za-z0-9]+:\\)$" . ((lambda (tag)
                                       (svg-tag-make tag :beg 2 :end -1))))))
#+end_src


#+RESULTS:
| \(:#[A-Za-z0-9]+\)   | (lambda (tag) (svg-tag-make tag :beg 2))         |
| \(:#[A-Za-z0-9]+:\)$ | (lambda (tag) (svg-tag-make tag :beg 2 :end -1)) |

** Org Mode Keywords
Adding a few of my own org mode keywords, because progress is never really as simple as "TODO" and "DONE"

#+begin_src emacs-lisp
 (setq org-todo-keywords
  '((sequence "TODO"
      "MAYBE"
      "IN-PROG"
      "WAITING"
      "DONE"
      "DEFERRED"
      "CANCELLED")))
#+end_src

#+RESULTS:
| sequence | TODO | MAYBE | IN-PROG | WAITING | DONE | DEFERRED | CANCELLED |

* LaTeX

XeLatex - again stolen from devin. Thank u, but this doesnt work with org-ref v3 so here's this giant code block :)

#+begin_src emacs-lisp
(setq org-latex-pdf-process
					; Always need a first pass
      '("xelatex -8bit -shell-escape -interaction nonstopmode -output-directory %o %f"
					; bibtex needs some help getting started, so if there is no bibtex file, gen
					; once generated (second+ pass), could be empty. If they're empty, no need to run:
        "sh -c 'if [ ! -f %b.bbl -o -s %b.bbl ] ;then bibtex %b; fi'"
					; A few things (reference spawning/table of contents/figures/etc) change intermediary files
					; This requires a re-run or two
        "sh -c 'while grep -q -e \"File \\`%b.out\\' has changed\" -e \"Rerun to get cross-references right\" %b.log; do xelatex -8bit -shell-escape -interaction nonstopmode -output-directory %o %f ;done'"))
#+end_src

#+RESULTS:
| xelatex -8bit -shell-escape -interaction nonstopmode -output-directory %o %f | sh -c 'if [ ! -f %b.bbl -o -s %b.bbl ] ;then bibtex %b; fi' | sh -c 'while grep -q -e "File \`%b.out\' has changed" -e "Rerun to get cross-references right" %b.log; do xelatex -8bit -shell-escape -interaction nonstopmode -output-directory %o %f ;done' |
+begin_src emacs-lisp
(setq org-latex-pdf-process
      (list "latexmk -shell-escape -bibtex -f -pdf %f"))
+end_src

#+RESULTS:
| latexmk -shell-escape -bibtex -f -pdf %f |

